import { ref } from 'vue'
import { defineStore } from 'pinia'
import bgCover from '../assets/images/Sara11715528640728420.png'
import manCover from '../assets/images/Sara11673171236302693.jpg'
import womanCover from '../assets/images/Sara11673171304295312.jpg'
import dayjs from 'dayjs'

export const useLoveInfoStore = defineStore('loveInfo', () => {
  let commemorationDay = dayjs().set('month', 3).set('date', 5)
  if (commemorationDay.isBefore(dayjs())) {
    commemorationDay = commemorationDay.set('year', commemorationDay.year() + 1)
  }

  const loveInfo = ref({
    bgCover,
    manCover,
    womanCover,
    manName: 'Sara',
    womanName: 'Abby',
    timing: '2022-03-15 12:00:00',
    countdownTitle: '纪念日倒计时',
    countdownTime: commemorationDay.format('YYYY-MM-DD'),
    familyInfo:
      '那年，曲奇小姐大三，她迎来有史以来最长的一次寒假。不想再次度过一个漫长又无趣的假期，她决定要做点什么。最后，她在离家很近的一个超市里找到了一份促销曲奇的工作，一直做到除夕。她想，刚好做完还有时间可以浪，完美！从此，便开始了她朝九晚五“愉快”的假期。\n\n不过，现实并木有她想的那么愉悦。她每天搁那杵着就是8个小时，反反复复也就那么两句台词，开心就嚷嚷两句，不过，倒像是只有她自己在听……当然，她也没那么敬业。没事要不就在数她的曲奇卖了几份，要不就瞄着来往过路的帅哥美女，要不就可能是在走神，似乎能在脑海上演一整部电视剧。(哦，她发现貌似发呆走神的时候，时间能过得飞快的不要不要的)。然后的然后，曲奇小姐就明白了一个真理——啊……原来一分钟可以有这么长；原来促销的时候没人理也是一件痛苦的事情。她一度怀疑：“难道现在的小孩子已经强大到可以抵挡零食的诱惑了么？连个小盆友都不鸟我?真是可惜我的试吃品……不过味道也确实不咋地，不然，可能早就被我偷吃了……哈哈哈”\n\n她的周围也有一群跟她一样的寒假工，大概也都是跟她一样闲着没事干吧。不过，她在其中一定是大姐大，毕竟都是大三老学姐了嘛，一群鲜肉们，嘻嘻。其中，她最羡慕两个人，两个运酒的少年，他们每天都可以“出双入对”的，没事还可以叙叙、玩玩，一定不无聊，唉……每次看到他们从我面前路过，我都要感叹一番。后来，大家每天抬头不见低头见的，也就有了萍水之交，没事也会打打招呼，瞎扯两句。也算是可以解解闷了，曲奇小姐如是想着……\n\n终于，要过年了！\n\n除夕前夜，曲奇小姐的内心是雀跃的，终于可以结束了，哈哈！一晚上感觉空气都是躁动的，就像每次考完期末考一样莫名的鸡冻……晚饭过后，她像平常一样回到她的地盘，想着如何耗过接下来的一个半小时。就在这时，那个没事还和我打招呼的运酒少年走过来了，问：“你QQ多少，我加你吧，过了今天，可能就来不及了。”曲奇小姐觉得：这个小伙真搞笑，于是就欣然地留下了她的QQ。闲聊了两句，大家又开始各自的任务了，嚷嚷的继续嚷嚷，运酒的继续运酒……\n\n让曲奇小姐奇怪的是，那个小伙子一直到第二天也没加她，她觉得一定是自己把账号打错了，真是太丢人了，难得人家还找你要账号，真是难为情啊！算了算了，就当什么也不知道吧，可能无缘有交集吧，反正下午就各回各家，各找各妈了，啧啧……她就这么敷衍一下自己，好让自己减少那么一点负罪感……下午曲奇小姐又来到那个超市，不过这次她是以一个正宗的顾客的身份来shopping的。就这么逛着逛着，她的手机响了一下——哦，原来她没有打错账号啊。\n\n少年加她时，留下了一串字：“2017年1月15日相遇，1月20日认识，1月27别。”曲奇小姐愣了一下，不知道什么心情，只觉得：“哦哟，可以的，小伙子，这都记得这么清！”\n\n那之后，他们没事就会聊聊天，天南地北的什么都谈，谈谈生活，谈谈未来，还谈另一半……少年似乎很会说话，总能找到很多谈资，也总是能说得很在理，也不时会冒出一些话，让她觉得挺感动，也蛮开心。虽然只有短短十多天不深不浅的聊天，她觉得似乎跟少年像认识了许久的朋友一样。大概少年也觉得跟她比较投缘吧，就这么一直聊着……\n\n渐渐地，曲奇小姐每天都很期待跟运酒少年聊天。她甚至还跟闺蜜们分享她纠结的心事，一群疯女人也很是雀跃啊，似乎比我还鸡冻，啧啧…不带这样还没开始，就先祝贺的啊喂！\n\n最后，她的远程助攻团们告诉她要抓住机会！\n\n她也决定了……是得要抓住那位！\n\n最后的最后，我想他们的故事应该是未完待续。loading……',
    likeCount: 0
  })

  const loveRecord = ref([
    { content: '宝贝出钱给我做了近视手术，呜呜呜呜呜感动', createTime: '2024-08-10' },
    { content: '结婚啦结婚啦结婚啦结婚啦结婚啦结婚啦结婚啦结婚啦结婚啦结婚啦', createTime: '2024-07-13' },
    { content: '领证啦领证啦领证啦领证啦领证啦领证啦领证啦领证啦领证啦领证啦', createTime: '2024-06-17' },
    { content: '二冲！金佛山，结果下雨了还是没玩好', createTime: '2024-05-04' },
    { content: '订婚啦，还定了结婚的日子', createTime: '2024-05-01' },
    { content: '冲！金佛山178环线', createTime: '2024-04-04' },
    { content: '陪宝贝说每周出去徒步一次，结果那次之后再也没有了，果然是两个水货', createTime: '2024-03-24' },
    { content: '上门提亲啦！', createTime: '2024-02-11' },
    { content: '冲！南天湖！但是并没有去看湖哈哈哈，转身回家打麻将了', createTime: '2024-01-28' },
    { content: '吃吃吃吃吃吃吃吃吃吃吃吃吃吃吃', createTime: '2024-11-01~' },
    { content: '冲！港澳！除了平潭之外感觉旅游照片最喜欢的一次', createTime: '2023-09-29' },
    { content: '冲！乐山！', createTime: '2023-08-04' },
    { content: '冲！四姑娘山！', createTime: '2023-06-03' },
    { content: '插播一条，房产证到手啦~', createTime: '2023-05-29' },
    {
      content:
        '今天是纪念日！在歌乐山找到一家环境很好的店，你说以后还要去但是到现在还没去，晚上还去了一家环境不错的西餐厅',
      createTime: '2023-04-05'
    },
    { content: '你去给遥哥当伴娘了，哭的瓜兮兮的', createTime: '2023-03-19' },
    { content: '骑摩托车去了茶山竹海，你说再也不去了，哎', createTime: '2023-03-11' },
    { content: '宝贝24啦，生日快乐~~~', createTime: '2023-02-02' },
    { content: '到我去见家长了，冲！！！', createTime: '2023-01-18' },
    { content: '来我家见家长啦，好紧张哈哈哈哈哈', createTime: '2023-01-01' },
    { content: '去平潭旅行啦，拍了好多好看的照片', createTime: '2022-10-03' },
    { content: '吃吃吃吃吃吃吃吃吃吃吃吃吃吃吃', createTime: '2022-08~' },
    { content: '第一次陪我过生，还给我画了我们两个的油画，感动！呜呜呜', createTime: '2022-07-29' },
    { content: '去涪陵玩啦', createTime: '2022-06-26' },
    { content: '嘿嘿嘿嘿嘿，竟然隔了一个多月', createTime: '2022-05-27' },
    { content: '一起去遵义（猜猜为什么记录这条）', createTime: '2022-04-16' },
    { content: '直接就在一起了，还是你忍不住先说了', createTime: '2022-04-06' },
    { content: '终于见面了,感觉有点慢', createTime: '2022-03-27' },
    { content: '加上微信啦', createTime: '2022-03-20' },
    { content: '你好，很高兴认识你。', createTime: '2022-03-15' }
  ])

  return { loveInfo, loveRecord }
})
